particle-iot/device-os/hal/src/nRF52840/spi_hal.cpp
/*
 * Copyright (c) 2020 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */
#include "logging.h"
#include <memory>
#include "nrf_gpio.h"
#include "nrfx_spim.h"
#include "nrfx_spis.h"
#include "spi_hal.h"
#include "pinmap_hal.h"
#include "pinmap_impl.h"
#include "gpio_hal.h"
#include "interrupts_hal.h"
#include "concurrent_hal.h"
#include "delay_hal.h"
#include "check.h"

#define DEFAULT_SPI_MODE        SPI_MODE_MASTER
#define DEFAULT_DATA_MODE       SPI_MODE3
#define DEFAULT_BIT_ORDER       MSBFIRST
#define DEFAULT_SPI_CLOCK       SPI_CLOCK_DIV256

typedef struct nrf5x_spi_info_t {
    const nrfx_spim_t*                  master;
    const nrfx_spis_t*                  slave;
    app_irq_priority_t                  priority;
    uint8_t                             ss_pin;
    uint8_t                             sck_pin;
    uint8_t                             mosi_pin;
    uint8_t                             miso_pin;

    hal_spi_mode_t                      spi_mode;
    uint8_t                             data_mode;
    uint8_t                             bit_order;
    uint32_t                            clock;

    volatile uint8_t                    spi_ss_state;
    uint8_t*                            slave_tx_buf;
    uint8_t*                            slave_rx_buf;
    uint32_t                            slave_buf_length;
    bool                                slave_tx_buf_heap;
    const uint8_t*                      master_tx_data;
    uint32_t                            master_tx_data_length;
    uint32_t                            master_tx_data_index;
    uint8_t*                            master_tx_buf;
    uint32_t                            master_tx_buf_length;
    uint8_t*                            master_rx_buf;

    hal_spi_dma_user_callback           dma_user_callback;
    hal_spi_select_user_callback        select_user_callback;

    volatile hal_spi_state_t            state;
    volatile bool                       transmitting;
    volatile uint16_t                   transfer_length;

    os_mutex_recursive_t                mutex;
} nrf5x_spi_info_t;

static const nrfx_spim_t m_spim2 = NRFX_SPIM_INSTANCE(2);
static const nrfx_spim_t m_spim3 = NRFX_SPIM_INSTANCE(3);
static const nrfx_spis_t m_spis2 = NRFX_SPIS_INSTANCE(2);

static nrf5x_spi_info_t spiMap[HAL_PLATFORM_SPI_NUM] = {
    {&m_spim3, nullptr,  APP_IRQ_PRIORITY_HIGH, PIN_INVALID, SCK, MOSI, MISO}, // TODO: SPI3 doesn't support SPI slave mode
#if PLATFORM_ID == PLATFORM_TRACKER
    {&m_spim2, &m_spis2, APP_IRQ_PRIORITY_HIGH, PIN_INVALID, SCK1, MOSI1, MISO1},
#else
    {&m_spim2, &m_spis2, APP_IRQ_PRIORITY_HIGH, PIN_INVALID, D2, D3, D4},  // TODO: Change pin number
#endif
};

static uint8_t dummy_buf = 0xFF;
os_queue_t slaveEventQueue = nullptr;
os_thread_t slaveWorkerThread = nullptr;

static uint32_t spiTransfer(hal_spi_interface_t spi, uint8_t *tx_buf, uint8_t *rx_buf, uint32_t size);

static bool spiMasterTransferChunk(hal_spi_interface_t spi) {
    if (!spiMap[spi].master_tx_data || !spiMap[spi].master_tx_buf) {
        return false;
    }
    if (spiMap[spi].master_tx_data_index >= spiMap[spi].master_tx_data_length) {
        return false;
    }
    spiMap[spi].transmitting = true; // Just in case
    uint32_t chunkSize = std::min(spiMap[spi].master_tx_data_length - spiMap[spi].master_tx_data_index, spiMap[spi].master_tx_buf_length);
    uint32_t index = spiMap[spi].master_tx_data_index;
    memcpy(spiMap[spi].master_tx_buf, &spiMap[spi].master_tx_data[index], chunkSize);
    uint8_t* rxPtr = spiMap[spi].master_rx_buf ? &spiMap[spi].master_rx_buf[index] : nullptr;
    SPARK_ASSERT(spiTransfer(spi, spiMap[spi].master_tx_buf, rxPtr, chunkSize) == chunkSize);
    spiMap[spi].master_tx_data_index += chunkSize;
    spiMap[spi].transfer_length += chunkSize;
    return true;
}

static void spiMasterEventHandler(nrfx_spim_evt_t const * p_event, void * p_context) {
    if (p_event->type == NRFX_SPIM_EVENT_DONE) {
        // LOG_DEBUG(TRACE, ">> spi: rx: %d, tx: %d", p_event->xfer_desc.tx_length, p_event->xfer_desc.rx_length);
        int spi = (int)p_context;

        if (spiMasterTransferChunk((hal_spi_interface_t)spi)) {
            return;
        }
        spiMap[spi].master_tx_data = nullptr;
        spiMap[spi].master_rx_buf = nullptr;
        spiMap[spi].master_tx_data_length = 0;
        spiMap[spi].master_tx_data_index = 0;
        spiMap[spi].master_tx_buf_length = 0;
        spiMap[spi].transmitting = false;
        if (spiMap[spi].dma_user_callback) {
            (*spiMap[spi].dma_user_callback)();
        }
    }
}

static void spiSlaveEventHandler(nrfx_spis_evt_t const * p_event, void * p_context) {
    int spi = (int) p_context;

    if (p_event->evt_type == NRFX_SPIS_XFER_DONE) {
        if (p_event->rx_amount == 0) {
            // FIXME: Dirty hack! It's possible that the master just toggles the CS pin,
            // without any data transfered. We should re-set the slave data buffer for
            // next data transmission
            uint8_t* txPtr = spiMap[spi].slave_tx_buf ? spiMap[spi].slave_tx_buf : &dummy_buf;
            uint32_t txLen = spiMap[spi].slave_tx_buf ? spiMap[spi].slave_buf_length : sizeof(dummy_buf);
            uint8_t* rxPtr = spiMap[spi].slave_rx_buf ? spiMap[spi].slave_rx_buf : &dummy_buf;
            uint32_t rxLen = spiMap[spi].slave_rx_buf ? spiMap[spi].slave_buf_length : sizeof(dummy_buf);
            SPARK_ASSERT(nrfx_spis_buffers_set(spiMap[spi].slave, txPtr, txLen, rxPtr, rxLen) == NRF_SUCCESS);
            return;
        }
        
