particle-iot/device-os/hal/src/nRF52840/spi_hal.cpp
        if (spiMap[spi].slave_rx_buf) {
            spiMap[spi].transfer_length = p_event->rx_amount;
        } else {
            // No rx_buffer provided, but we set the pointer to dummy_buf
            // it will receive 1 byte anyway, but available() should return 0.
            spiMap[spi].transfer_length = 0;
        }

        if (spiMap[spi].slave_tx_buf_heap) {
            if (slaveEventQueue) {
                os_queue_put(slaveEventQueue, (hal_spi_interface_t*)&spi, 0, nullptr);
            }
        }

        spiMap[spi].transmitting = false;
        
        // We should notify application, despite of how many data we received.
        // if (p_event->rx_amount) {
            if (spiMap[spi].dma_user_callback) {
                (*spiMap[spi].dma_user_callback)();
            }
        // }
        // LOG_DEBUG(TRACE, ">> spi: rx: %d, tx: %d", p_event->rx_amount, p_event->tx_amount);

        // We don't need to re-set the slave buffer, unless user sets the buffer again.
        // SPARK_ASSERT(nrfx_spis_buffers_set(spiMap[spi].slave,
        //                                 (uint8_t *)spiMap[spi].slave_tx_buf,
        //                                 spiMap[spi].slave_buf_length,
        //                                 (uint8_t *)spiMap[spi].slave_rx_buf,
        //                                 spiMap[spi].slave_buf_length) == NRF_SUCCESS);
    } else if (p_event->evt_type == NRFX_SPIS_BUFFERS_SET_DONE) {
        // LOG_DEBUG(TRACE, ">> NRFX_SPIS_BUFFERS_SET_DONE");
    }
}

static os_thread_return_t spiSlaveWorkerThread(void* param) {
    while (1) {
        hal_spi_interface_t spi;
        if (!os_queue_take(slaveEventQueue, &spi, CONCURRENT_WAIT_FOREVER, nullptr)) {
            if (spiMap[spi].slave_tx_buf_heap) {
                free(spiMap[spi].slave_tx_buf);
                spiMap[spi].slave_tx_buf_heap = false;
            }
        }
    }
    os_thread_exit(slaveWorkerThread);
}

static void spiOnSelectedHandler(void *data) {
    int spi = (int)data;
    uint8_t state = !HAL_GPIO_Read(spiMap[spi].ss_pin);
    spiMap[spi].spi_ss_state = state;
    if (spiMap[spi].select_user_callback) {
        spiMap[spi].select_user_callback(state);
    }
}

static inline nrf_spim_frequency_t getNrfSpiFrequency(hal_spi_interface_t spi, uint8_t clock_div) {
    switch (clock_div) {
        case SPI_CLOCK_DIV2:
            if (spi == HAL_SPI_INTERFACE1) {
                return NRF_SPIM_FREQ_32M;
            }
        case SPI_CLOCK_DIV4:
            if (spi == HAL_SPI_INTERFACE1) {
                return NRF_SPIM_FREQ_16M;
            }
        case SPI_CLOCK_DIV8:
            return NRF_SPIM_FREQ_8M;
        case SPI_CLOCK_DIV16:
            return NRF_SPIM_FREQ_4M;
        case SPI_CLOCK_DIV32:
            return NRF_SPIM_FREQ_2M;
        case SPI_CLOCK_DIV64:
            return NRF_SPIM_FREQ_1M;
        case SPI_CLOCK_DIV128:
            return NRF_SPIM_FREQ_500K;
        case SPI_CLOCK_DIV256:
            return NRF_SPIM_FREQ_250K;
    }

    return NRF_SPIM_FREQ_8M;
}

static inline uint8_t getNrfPinNum(uint8_t pin) {
    if (pin >= TOTAL_PINS) {
        return NRFX_SPIM_PIN_NOT_USED;
    }

    Hal_Pin_Info* PIN_MAP = HAL_Pin_Map();
    return NRF_GPIO_PIN_MAP(PIN_MAP[pin].gpio_port, PIN_MAP[pin].gpio_pin);
}

static void spiInit(hal_spi_interface_t spi, hal_spi_mode_t mode) {
    uint32_t err_code;

    if (mode == SPI_MODE_MASTER) {
        static const nrf_spim_mode_t nrf_spim_mode[4] = {NRF_SPIM_MODE_0, NRF_SPIM_MODE_1, NRF_SPIM_MODE_2, NRF_SPIM_MODE_3};
        nrfx_spim_config_t spim_config = NRFX_SPIM_DEFAULT_CONFIG;
        spim_config.sck_pin      = getNrfPinNum(spiMap[spi].sck_pin);
        spim_config.mosi_pin     = getNrfPinNum(spiMap[spi].mosi_pin);
        spim_config.miso_pin     = getNrfPinNum(spiMap[spi].miso_pin);
        spim_config.ss_pin       = NRFX_SPIM_PIN_NOT_USED;
        spim_config.irq_priority = spiMap[spi].priority;
        spim_config.orc          = 0xFF;
        spim_config.frequency    = getNrfSpiFrequency(spi, spiMap[spi].clock);
        spim_config.mode         = nrf_spim_mode[spiMap[spi].data_mode];
        spim_config.bit_order    = (spiMap[spi].bit_order == MSBFIRST) ? NRF_SPIM_BIT_ORDER_MSB_FIRST : NRF_SPIM_BIT_ORDER_LSB_FIRST;

        err_code = nrfx_spim_init(spiMap[spi].master, &spim_config, spiMasterEventHandler, (void *)((int)spi));
        SPARK_ASSERT(err_code == NRF_SUCCESS);

        if (HAL_Pin_Is_Valid(spiMap[spi].ss_pin)) {
            hal_gpio_config_t conf = {
                .size = sizeof(conf),
                .version = HAL_GPIO_VERSION,
                .mode = OUTPUT,
                .set_value = true,
                .value = 1,
                .drive_strength = HAL_GPIO_DRIVE_HIGH,
            };
            HAL_Pin_Configure(spiMap[spi].ss_pin, &conf, nullptr);
        }
    } else {
        static const nrf_spis_mode_t nrf_spis_mode[4] = {NRF_SPIS_MODE_0, NRF_SPIS_MODE_1, NRF_SPIS_MODE_2, NRF_SPIS_MODE_3};
        nrfx_spis_config_t spis_config;
        spis_config.sck_pin      = getNrfPinNum(spiMap[spi].sck_pin);
        spis_config.mosi_pin     = getNrfPinNum(spiMap[spi].mosi_pin);
        spis_config.miso_pin     = getNrfPinNum(spiMap[spi].miso_pin);
        spis_config.csn_pin      = getNrfPinNum(spiMap[spi].ss_pin);
        spis_config.csn_pullup   = NRF_GPIO_PIN_PULLUP;
        spis_config.miso_drive   = NRF_GPIO_PIN_S0S1;
        spis_config.irq_priority = spiMap[spi].priority;
        spis_config.orc          = 0xFF;
        spis_config.def          = 0xFF;
        spis_config.mode         = nrf_spis_mode[spiMap[spi].data_mode];
        spis_config.bit_order    = (spiMap[spi].bit_order == MSBFIRST) ? NRF_SPIS_BIT_ORDER_MSB_FIRST : NRF_SPIS_BIT_ORDER_LSB_FIRST;

        err_code = nrfx_spis_init(spiMap[spi].slave, &spis_config, spiSlaveEventHandler, (void *)((int) spi));
        SPARK_ASSERT(err_code == NRF_SUCCESS);

        HAL_Pin_Mode(spiMap[spi].ss_pin, INPUT_PULLUP);
        HAL_Interrupts_Attach(spiMap[spi].ss_pin, &spiOnSelectedHandler, (void*)(spi), CHANGE, nullptr);
    }

    // Set pin function
    HAL_Set_Pin_Function(spiMap[spi].sck_pin, PF_SPI);
    HAL_Set_Pin_Function(spiMap[spi].mosi_pin, PF_SPI);
    HAL_Set_Pin_Function(spiMap[spi].miso_pin, PF_SPI);
}

static void spiUninit(hal_spi_interface_t spi) {
    if (spiMap[spi].spi_mode == SPI_MODE_MASTER) {
        nrfx_spim_uninit(spiMap[spi].master);
    } else {
        nrfx_spis_uninit(spiMap[spi].slave);
        HAL_Interrupts_Detach(spiMap[spi].ss_pin);
    }

    HAL_Pin_Mode(spiMap[spi].sck_pin, INPUT_PULLUP);
    HAL_Pin_Mode(spiMap[spi].mosi_pin, PIN_MODE_NONE);
    HAL_Pin_Mode(spiMap[spi].miso_pin, PIN_MODE_NONE);

    HAL_Set_Pin_Function(spiMap[spi].sck_pin, PF_NONE);
    HAL_Set_Pin_Function(spiMap[spi].mosi_pin, PF_NONE);
    HAL_Set_Pin_Function(spiMap[spi].miso_pin, PF_NONE);
}

static uint32_t spiTransfer(hal_spi_interface_t spi, uint8_t *tx_buf, uint8_t *rx_buf, uint32_t size) {
    // LOG_DEBUG(TRACE, "spi send, size: %d", size);

    uint32_t err_code;
    spiMap[spi].transmitting = true;

    nrfx_spim_xfer_desc_t const spim_xfer_desc = {
        .p_tx_buffer = tx_buf,
        .tx_length   = tx_buf ? size : 0,
        .p_rx_buffer = rx_buf,
        .rx_length   = rx_buf ? size : 0,
    };
    err_code = nrfx_spim_xfer(spiMap[spi].master, &spim_xfer_desc, 0);

    if (err_code) {
        spiMap[spi].transmitting = false;
    }

    return err_code ? 0 : size;
}

static void spiTransferCancel(hal_spi_interface_t spi) {
    if (spiMap[spi].spi_mode == SPI_MODE_MASTER) {
        nrfx_spim_abort(spiMap[spi].master);
    } else {
        while (nrfx_spis_buffers_set(spiMap[spi].slave, nullptr, 0, nullptr, 0) == NRFX_ERROR_INVALID_STATE);
    }
}

void hal_spi_init(hal_spi_interface_t spi) {
    os_thread_scheduling(false, nullptr);
    if (spiMap[spi].mutex == nullptr) {
        os_mutex_recursive_create(&spiMap[spi].mutex);
    }
    os_thread_scheduling(true, nullptr);

    hal_spi_acquire(spi, nullptr);

    if (spiMap[spi].state == HAL_SPI_STATE_ENABLED) {
        spiUninit(spi);
    }

    // Default: SPI_MODE_MASTER, SPI_MODE3, MSBFIRST, 16MHZ
    spiMap[spi].state = HAL_SPI_STATE_DISABLED;
    spiMap[spi].transmitting = false;
    spiMap[spi].spi_mode = DEFAULT_SPI_MODE;
    spiMap[spi].bit_order = DEFAULT_BIT_ORDER;
    spiMap[spi].data_mode = DEFAULT_DATA_MODE;
    spiMap[spi].clock = DEFAULT_SPI_CLOCK;
    spiMap[spi].spi_ss_state = 0;
    spiMap[spi].dma_user_callback = nullptr;
    spiMap[spi].select_user_callback = nullptr;
    spiMap[spi].transfer_length = 0;
    spiMap[spi].master_tx_data = nullptr;
    spiMap[spi].master_tx_buf = nullptr;
    spiMap[spi].master_rx_buf = nullptr;
    spiMap[spi].master_tx_data_length = 0;
    spiMap[spi].master_tx_data_index = 0;
    spiMap[spi].master_tx_buf_length = 0;
    spiMap[spi].slave_tx_buf_heap = false;

    hal_spi_release(spi, nullptr);
}

void hal_spi_begin(hal_spi_interface_t spi, uint16_t pin) {
    // Default to Master mode
    hal_spi_begin_ext(spi, SPI_MODE_MASTER, pin, nullptr);
}

void hal_spi_begin_ext(hal_spi_interface_t spi, hal_spi_mode_t mode, uint16_t pin, void* reserved) {
    if (spi >= HAL_PLATFORM_SPI_NUM) {
        return;
    }

