particle-iot/device-os/hal/src/nRF52840/spi_hal.cpp
        // The nrfx driver will panic if either of the pointer is NULL.
        uint8_t* txPtr = spiMap[spi].slave_tx_buf ? spiMap[spi].slave_tx_buf : &dummy_buf;
        uint32_t txLen = spiMap[spi].slave_tx_buf ? length : sizeof(dummy_buf);
        uint8_t* rxPtr = spiMap[spi].slave_rx_buf ? spiMap[spi].slave_rx_buf : &dummy_buf;
        uint32_t rxLen = spiMap[spi].slave_rx_buf ? length : sizeof(dummy_buf);

        // Use for synchronization
        spiMap[spi].transmitting = true;
        // reset transfer length
        spiMap[spi].transfer_length = 0;
        
        uint32_t err_code = nrfx_spis_buffers_set(spiMap[spi].slave, txPtr, txLen, rxPtr, rxLen);
        if (err_code == NRF_ERROR_INVALID_STATE) {
            // LOG_DEBUG(WARN, "nrfx_spis_buffers_set, invalid state");
            if (spiMap[spi].slave_tx_buf_heap) {
                free(spiMap[spi].slave_tx_buf);
                spiMap[spi].slave_tx_buf_heap = false;
            }
            spiMap[spi].transmitting = false;
        } else {
            SPARK_ASSERT(err_code == NRF_SUCCESS);
        }
    }
}

void hal_spi_transfer_dma_cancel(hal_spi_interface_t spi) {
    if (!spiMap[spi].transmitting) {
        return;
    }
    spiTransferCancel(spi);
    spiMap[spi].dma_user_callback = nullptr;
    spiMap[spi].transmitting = false;
}

int32_t hal_spi_transfer_dma_status(hal_spi_interface_t spi, hal_spi_transfer_status_t* st) {
    int32_t transfer_length = 0;

    if (spiMap[spi].transmitting) {
        transfer_length = 0;
    } else {
        transfer_length = spiMap[spi].transfer_length;
    }

    if (st != nullptr) {
        st->configured_transfer_length = spiMap[spi].transfer_length;
        st->transfer_length = (uint32_t)transfer_length;
        st->transfer_ongoing = spiMap[spi].transmitting;
        st->ss_state = spiMap[spi].spi_ss_state;
    }

    return transfer_length;
}

int32_t hal_spi_set_settings(hal_spi_interface_t spi, uint8_t set_default, uint8_t clockdiv, uint8_t order, uint8_t mode, void* reserved) {
    if (set_default) {
        spiMap[spi].data_mode = DEFAULT_DATA_MODE;
        spiMap[spi].bit_order = DEFAULT_BIT_ORDER;
        spiMap[spi].clock = DEFAULT_SPI_CLOCK;
    } else {
        spiMap[spi].data_mode = mode;
        spiMap[spi].bit_order = order;
        spiMap[spi].clock = clockdiv;
    }

    if (spiMap[spi].state == HAL_SPI_STATE_ENABLED) {
        spiUninit(spi);
        spiInit(spi, spiMap[spi].spi_mode);
    }

    return 0;
}

int hal_spi_sleep(hal_spi_interface_t spi, bool sleep, void* reserved) {
    if (sleep) {
        CHECK_TRUE(hal_spi_is_enabled(spi), SYSTEM_ERROR_INVALID_STATE);
        while (spiMap[spi].transmitting);
        spiUninit(spi);
        // spiUninit() clears pin function, retrieve it.
        HAL_Set_Pin_Function(spiMap[spi].sck_pin, PF_SPI);
        HAL_Set_Pin_Function(spiMap[spi].mosi_pin, PF_SPI);
        HAL_Set_Pin_Function(spiMap[spi].miso_pin, PF_SPI);
        spiMap[spi].state = HAL_SPI_STATE_SUSPENDED;
    } else {
        CHECK_TRUE(spiMap[spi].state == HAL_SPI_STATE_SUSPENDED, SYSTEM_ERROR_INVALID_STATE);
        hal_spi_begin_ext(spi, spiMap[spi].spi_mode, spiMap[spi].ss_pin, nullptr);
    }
    return SYSTEM_ERROR_NONE;
}

int32_t hal_spi_acquire(hal_spi_interface_t spi, const hal_spi_acquire_config_t* conf) {
    if (!HAL_IsISR()) {
        os_mutex_recursive_t mutex = spiMap[spi].mutex;
        if (mutex) {
            // FIXME: os_mutex_recursive_lock doesn't take any arguments, using trylock for now
            if (!conf || conf->timeout != 0) {
                return os_mutex_recursive_lock(mutex);
            } else {
                return os_mutex_recursive_trylock(mutex);
            }
        }
    }
    return -1;
}

int32_t hal_spi_release(hal_spi_interface_t spi, void* reserved) {
    if (!HAL_IsISR()) {
        os_mutex_recursive_t mutex = spiMap[spi].mutex;
        if (mutex) {
            return os_mutex_recursive_unlock(mutex);
        }
    }
    return -1;
}
